app/controllers/flights_controller.rb

    def set_flight
      @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]